pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxEray_reg.h
/** \brief 6B8, Read Data Section 47 */
#define ERAY0_RDDS_1S46 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6B8u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S46.
* To use register names with standard convension, please use ERAY0_RDDS_1S46.
*/
#define ERAY0_RDDS47 (ERAY0_RDDS_1S46)

/** \brief 6BC, Read Data Section 48 */
#define ERAY0_RDDS_1S47 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6BCu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S47.
* To use register names with standard convension, please use ERAY0_RDDS_1S47.
*/
#define ERAY0_RDDS48 (ERAY0_RDDS_1S47)

/** \brief 6C0, Read Data Section 49 */
#define ERAY0_RDDS_1S48 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6C0u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S48.
* To use register names with standard convension, please use ERAY0_RDDS_1S48.
*/
#define ERAY0_RDDS49 (ERAY0_RDDS_1S48)

/** \brief 6C4, Read Data Section 50 */
#define ERAY0_RDDS_1S49 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6C4u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S49.
* To use register names with standard convension, please use ERAY0_RDDS_1S49.
*/
#define ERAY0_RDDS50 (ERAY0_RDDS_1S49)

/** \brief 6C8, Read Data Section 51 */
#define ERAY0_RDDS_1S50 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6C8u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S50.
* To use register names with standard convension, please use ERAY0_RDDS_1S50.
*/
#define ERAY0_RDDS51 (ERAY0_RDDS_1S50)

/** \brief 6CC, Read Data Section 52 */
#define ERAY0_RDDS_1S51 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6CCu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S51.
* To use register names with standard convension, please use ERAY0_RDDS_1S51.
*/
#define ERAY0_RDDS52 (ERAY0_RDDS_1S51)

/** \brief 6D0, Read Data Section 53 */
#define ERAY0_RDDS_1S52 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6D0u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S52.
* To use register names with standard convension, please use ERAY0_RDDS_1S52.
*/
#define ERAY0_RDDS53 (ERAY0_RDDS_1S52)

/** \brief 6D4, Read Data Section 54 */
#define ERAY0_RDDS_1S53 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6D4u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S53.
* To use register names with standard convension, please use ERAY0_RDDS_1S53.
*/
#define ERAY0_RDDS54 (ERAY0_RDDS_1S53)

/** \brief 6D8, Read Data Section 55 */
#define ERAY0_RDDS_1S54 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6D8u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S54.
* To use register names with standard convension, please use ERAY0_RDDS_1S54.
*/
#define ERAY0_RDDS55 (ERAY0_RDDS_1S54)

/** \brief 6DC, Read Data Section 56 */
#define ERAY0_RDDS_1S55 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6DCu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S55.
* To use register names with standard convension, please use ERAY0_RDDS_1S55.
*/
#define ERAY0_RDDS56 (ERAY0_RDDS_1S55)

/** \brief 6E0, Read Data Section 57 */
#define ERAY0_RDDS_1S56 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6E0u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S56.
* To use register names with standard convension, please use ERAY0_RDDS_1S56.
*/
#define ERAY0_RDDS57 (ERAY0_RDDS_1S56)

/** \brief 6E4, Read Data Section 58 */
#define ERAY0_RDDS_1S57 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6E4u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S57.
* To use register names with standard convension, please use ERAY0_RDDS_1S57.
*/
#define ERAY0_RDDS58 (ERAY0_RDDS_1S57)

/** \brief 6E8, Read Data Section 59 */
#define ERAY0_RDDS_1S58 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6E8u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S58.
* To use register names with standard convension, please use ERAY0_RDDS_1S58.
*/
#define ERAY0_RDDS59 (ERAY0_RDDS_1S58)

/** \brief 6EC, Read Data Section 60 */
#define ERAY0_RDDS_1S59 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6ECu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S59.
* To use register names with standard convension, please use ERAY0_RDDS_1S59.
*/
#define ERAY0_RDDS60 (ERAY0_RDDS_1S59)

/** \brief 6F0, Read Data Section 61 */
#define ERAY0_RDDS_1S60 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6F0u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S60.
* To use register names with standard convension, please use ERAY0_RDDS_1S60.
*/
#define ERAY0_RDDS61 (ERAY0_RDDS_1S60)

/** \brief 6F4, Read Data Section 62 */
#define ERAY0_RDDS_1S61 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6F4u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S61.
* To use register names with standard convension, please use ERAY0_RDDS_1S61.
*/
#define ERAY0_RDDS62 (ERAY0_RDDS_1S61)

/** \brief 6F8, Read Data Section 63 */
#define ERAY0_RDDS_1S62 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6F8u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S62.
* To use register names with standard convension, please use ERAY0_RDDS_1S62.
*/
#define ERAY0_RDDS63 (ERAY0_RDDS_1S62)

/** \brief 6FC, Read Data Section 64 */
#define ERAY0_RDDS_1S63 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C6FCu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S63.
* To use register names with standard convension, please use ERAY0_RDDS_1S63.
*/
#define ERAY0_RDDS64 (ERAY0_RDDS_1S63)

/** \brief 700, Read Header Section 1 */
#define ERAY0_RDHS1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDHS1*)0xF001C700u)

/** \brief 704, Read Header Section 2 */
#define ERAY0_RDHS2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDHS2*)0xF001C704u)

/** \brief 708, Read Header Section 3 */
#define ERAY0_RDHS3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDHS3*)0xF001C708u)

/** \brief 70C, Message Buffer Status */
#define ERAY0_MBS /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MBS*)0xF001C70Cu)

/** \brief 710, Output Buffer Command Mask */
#define ERAY0_OBCM /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OBCM*)0xF001C710u)

/** \brief 714, Output Buffer Command Request */
#define ERAY0_OBCR /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OBCR*)0xF001C714u)

/** \brief 870, OCDS Trigger Set Select */
#define ERAY0_OTSS /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OTSS*)0xF001C870u)

/** \brief 8E8, OCDS Control and Status */
#define ERAY0_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OCS*)0xF001C8E8u)

/** \brief 8EC, Kernel Reset Status Clear Register */
#define ERAY0_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_KRSTCLR*)0xF001C8ECu)

/** \brief 8F0, Kernel Reset Register 1 */
#define ERAY0_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_KRST1*)0xF001C8F0u)

/** \brief 8F4, Kernel Reset Register 0 */
#define ERAY0_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_KRST0*)0xF001C8F4u)

/** \brief 8FC, Access Enable Register 0 */
#define ERAY0_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ACCEN0*)0xF001C8FCu)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXERAY_REG_H */
